esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam4s/svd/SAM4S8C.svd
        <register>
          <name>WUMR</name>
          <description>Supply Controller Wake Up Mode Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMEN</name>
              <description>Supply Monitor Wake Up Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the supply monitor detection has no wake up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the supply monitor detection forces the wake up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTTEN</name>
              <description>Real Time Timer Wake Up Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the RTT alarm signal has no wake up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the RTT alarm signal forces the wake up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEN</name>
              <description>Real Time Clock Wake Up Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the RTC alarm signal has no wake up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the RTC alarm signal forces the wake up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCEN0</name>
              <description>Low power Debouncer ENable WKUP0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the WKUP0 input pin is not connected with low power debouncer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the WKUP0 input pin is connected with low power debouncer and can force a core wake up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCEN1</name>
              <description>Low power Debouncer ENable WKUP1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the WKUP1input pin is not connected with low power debouncer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the WKUP1 input pin is connected with low power debouncer and can force a core wake up.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBCCLR</name>
              <description>Low power Debouncer Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>a low power debounce event does not create an immediate clear on first half GPBR registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>a low power debounce event on WKUP0 or WKUP1 generates an immediate clear on first half GPBR registers.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPDBC</name>
              <description>Wake Up Inputs Debouncer Period</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 3 SLCK periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 512 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 4,096 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32768_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 32,768 SLCK periods</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPDBC</name>
              <description>Low Power DeBounCer Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the low power debouncer.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_RTCOUT0</name>
                  <description>WKUP0/1 in its active state for at least 2 RTCOUT0 periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_RTCOUT0</name>
                  <description>WKUP0/1 in its active state for at least 3 RTCOUT0 periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_RTCOUT0</name>
                  <description>WKUP0/1 in its active state for at least 4 RTCOUT0 periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_RTCOUT0</name>
                  <description>WKUP0/1 in its active state for at least 5 RTCOUT0 periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_RTCOUT0</name>
                  <description>WKUP0/1 in its active state for at least 6 RTCOUT0 periods</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7_RTCOUT0</name>
                  <description>WKUP0/1 in its active state for at least 7 RTCOUT0 periods</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_RTCOUT0</name>
                  <description>WKUP0/1 in its active state for at least 8 RTCOUT0 periods</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
